## Imports and setup

### Imports

In [1]:
from openai import OpenAI

from tkinter import * 
from tkinter import ttk
from tkinter import Tk 

import sqlalchemy
import os
import pandas as pd
from tabulate import tabulate

from dotenv import load_dotenv
import os 
import json 
import re 
import csv

from sqlalchemy import create_engine, MetaData, Table
from sqlalchemy import create_engine, text,Column, Integer, String, Float, Date, ForeignKey
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy.orm import relationship

DBTYPE = 'postgres'

### Load SQL

#### Load Oracle

In [2]:
# ! hi

load_dotenv()

oracle_connection_string = os.getenv('ORACLE_CONNECTION_STRING')

if oracle_connection_string:
    try:
        engine = create_engine(oracle_connection_string)
        connection = engine.connect()
        print("Connected to Oracle database successfully!")
        connection.close()
    except Exception as e:
        print("Error:", e)
else:
    print("Error: ORACLE_CONNECTION_STRING environment variable is not set.")
 
engine = create_engine(oracle_connection_string)
connection = engine.connect()

Connected to Oracle database successfully!

#### Load Postgres

In [2]:
load_dotenv()

pgsql_connection_string = os.getenv('PSQL_CONNECTION_STRING')
if pgsql_connection_string:
    try:
        engine = create_engine(pgsql_connection_string)
        connection = engine.connect()
        print('Connected to Postgres Successfully!')
        connection.close()
    except Exception as e:
        print('Error:',e)
else:
    print('Error: psql_connection_string environment variable not set')


engine = create_engine(pgsql_connection_string)
connection = engine.connect()

Connected to Postgres Successfully!

#### Load SQLITE

In [28]:
load_dotenv()

sqlite_connection_string = os.getenv('SQLITE_CONNECTION_STRING')
print(sqlite_connection_string)
if sqlite_connection_string:
    try: 
        engine = create_engine('sqlite:///main.db')
        connection = engine.connect()
        print('Connected to Sqlite Successfully!')
        connection.close()
    except Exception as e:
        print('Error:',e)
else:
    print('Error: Connection String not found')

engine = create_engine('sqlite:///main.db')

sqlite://main.db
Connected to Sqlite Successfully!

#### Define Tables (unused)

In [3]:
#Define Tables

metadata = MetaData() 

employees_table = Table('employees',metadata,autoload_with=engine)
discounts_table = Table('discounts',metadata,autoload_with=engine)
producers_table = Table('producers',metadata,autoload_with=engine)
produces_table = Table('produces',metadata,autoload_with=engine)
products_table = Table('products',metadata,autoload_with=engine)
purchases_table = Table('purchases',metadata,autoload_with=engine)
storehours_table = Table('storehours',metadata,autoload_with=engine)
stores_table = Table('stores',metadata,autoload_with=engine)
transactions_table = Table('transactions',metadata,autoload_with=engine)
members_table = Table('members',metadata,autoload_with=engine)

In [10]:
with engine.connect() as connection:
    result = connection.execute(text('select * from members;'))
    rows = result.fetchall()

    for row in rows:
        print(row)

(1, 'John Smith', '123 Main Street', '1')
(2, 'Alice Lee', '456 Elm Avenue', '1')

### LLM Helper Functions

In [3]:
if DBTYPE == 'oracle':
    with open('primer.txt', 'r') as file:
        primer = file.read()
elif DBTYPE == 'postgres':
    with open('postgresprimer.txt','r') as file:
        primer = file.read()

primobj = {'role':'system','content':primer}

In [4]:
client = OpenAI()
def convCompletion(completion,type='direct'):
    return {'role':'assistant','content':completion.choices[0].message.content if type=='direct' else completion}
def convQuery(query,role='user'):
    return {'role': role,'content':query}

# completion = client.chat.completions.create(
#   model="gpt-3.5-turbo",
#   messages=[
#     primobj,
#     {"role": "user", "content": "Compose a poem that explains the concept of recursion in programming."},
#   ]
# )

def doConv(t=3, model='ft:gpt-3.5-turbo-0125:personal::96kERypj'):
    msgs = [primobj]
    for i in range(t):
        a = input('Enter query')
        query = convQuery(a)
        msgs.append(query) 
        completion = client.chat.completions.create(
          model=model,
          messages=msgs
        )
        print('user:',a)
        print('bot:',completion.choices[0].message.content)
        msgs.append(convCompletion(completion))


def sendUserQuery(msg,model='ft:gpt-3.5-turbo-0125:personal::96kERypj'):
    query = convQuery(msg)
    msgs = [primobj, query]
    msgs.append(query) 
    completion = client.chat.completions.create(
        model=model,
        messages=msgs
    )
    return completion.choices[0].message.content
    
def executeQuery(msg):
    print('user:',msg)
    print('bot:',sendUserQuery(msg)) 
# doConv()
        
# executeQuery('find cheapest product at store name honey farms')
# print(completion.choices[0].message.content)

def printConv(msgs):
    for msg in msgs:
        print(msg['role']+":",msg['content'])

In [4]:
print(executeQuery('find all members who have spent more than 30'))

user: find all members who have spent more than 30
bot: SELECT T1.mid FROM MEMBERS AS T1 JOIN TRANSACTIONS AS T2 ON T1.mid  =  T2.mid JOIN PURCHASES AS T3 ON T2.tid  =  T3.tid JOIN PRODUCTS AS T4 ON T3.pid  =  T4.pid GROUP BY T1.mid HAVING sum(T3.quantity * T4.price)  >  30
None

## UI Code

#### Helper Functions

In [6]:
def guiDoQuery(*args):
    res = sendUserQuery(userquery.get())
    print(res)
    botresponse.set(res)

def executeSQL(sqlresponse,*args):
    for widget in mainframe.grid_slaves(row=5,column=2):
        widget.grid_forget()

    with engine.connect() as connection:        
        try:
            runquery = connection.execute(text(sql.get()))
            result = runquery.fetchall()
            cols = runquery.keys()
            runquery.close()

            # print(type(cols))
            table = [list(cols)]+result
            temp = tabulate(table,headers='firstrow',tablefmt='fancy_grid')

            sqlresponse = makeTable(mainframe,data=table)
            sqlresponse.grid(row=5,column=2,rowspan=3,columnspan=10,sticky=(N,W))

            
        except Exception as e:
            # sqlresponse.forget()
            sqlresponse = Text(mainframe)
            sqlresponse.insert(END,e)
            sqlresponse.config(state=DISABLED)
            sqlresponse.grid(row=5,column=2,rowspan=3, columnspan=10,sticky=(N,W))
        
def makeTable(rt,data):
    frame = ttk.Frame(rt)

    for i in range(len(data)):
        for j in range(len(data[0])):
            e = Text(frame,width=20,height=3)
            e.grid(row=i,column=j)

            e.insert(END,data[i][j])
            e.config(state=DISABLED)

            if i==0:
                e.tag_configure('bold', font=('TkDefaultFont',12,'bold'))
                e.tag_add('bold','1.0','end')

    return frame

def clearInp():
    sql.set('')
    userquery.set('')

#### Run Full UI

In [7]:
root = Tk()
root.title("SQL LLM")

#Initialize Main Frame
mainframe = ttk.Frame(root, padding="3 3 12 12")
mainframe.grid(column=0, row=0, sticky=(N, W, E, S))
root.columnconfigure(0, weight=1)
root.rowconfigure(0, weight=1)

#Begin user entry spot
#Grid:  (1,1),(1,2),(1,3),(1,4)
userquery = StringVar()
userquery_entry = ttk.Entry(mainframe, width=10, textvariable=userquery)
ttk.Label(mainframe, text='Enter query:').grid(column=1,row=1,sticky=(W))
userquery_entry.grid(column=2, row=1, sticky=(W, E))
ttk.Button(mainframe, text='Execute Query',command=guiDoQuery).grid(row=1,column=3)
ttk.Button(mainframe,text='Send to sql',command=lambda:sql.set(botresponse.get())).grid(row=1,column=4)
#Bot Response
#Grid: (1,10), (1,11)
botresponse = StringVar()
botresponse.set('hi')
ttk.Label(mainframe,text='Bot Response').grid(column=10,row=1)
ttk.Label(mainframe, textvariable=botresponse).grid(column=11, row=1, sticky=(W, E))

#SQL Entry
#Grid: (5,1),(5,2)-(7,12),(3,1),(3,2)
sql = StringVar() 
sql_entry = ttk.Entry(mainframe,width=20, textvariable=sql).grid(column=1,row=5,sticky=(N))
sqlresponse = makeTable(mainframe, [ ['ID','Name','Salary',],[3,'a b',333333],[3,'a b',333333],[3,'a b',333333]])
sqlresponse.grid(row=5,column=2,rowspan=3,columnspan=10,sticky=(N,W))
ttk.Label(mainframe,text='SQL To Execute:').grid(column=1,row=3,sticky=W)
ttk.Button(mainframe,text='Execute SQL',command=lambda:executeSQL(sqlresponse)).grid(column=2,row=3,sticky=W)
ttk.Button(mainframe,text='Clear', command=clearInp).grid(row=3,column=3)

for child in mainframe.winfo_children(): 
    child.grid_configure(padx=5, pady=5)

userquery_entry.focus()



testquery = [ ['name','id','test'],['sdf',3,'ewr'],['sdf',3,'ewr'],['sdf',3,'ewr'],]
root.mainloop()

SELECT * FROM members

## Testing Suite

### Run Tests

#### Helper Functions

In [6]:
def extract_queries_from_file(file_path,includesemi=False):
    with open(file_path, 'r') as file:
        sql_content = file.read()

    # Split SQL content into individual queries
    # queries = re.split(r';\s*\n(?![\s\w]*SELECT)', sql_content)
    queries = sql_content.split(';')
    queries = [query.strip() for query in queries if query.strip()]
    queries = [q.replace('\n',' ') for q in queries]

    if includesemi:
        queries = [query + ';' for query in queries]

    # Remove empty or whitespace-only queries
    # queries = [query.strip() for query in queries if query.strip()]

    return queries

def shortenString(text, l=20):
    return text[:l] + '...' if len(text) > l else ''

def debugResult(userquery,sql2, initresult,sqlres, querylim=5,debug=False):
    msgs = [primobj,convQuery(userquery),convQuery(initresult,role='assistant')]

    fixed = False
    i = 0 
    curerr = sqlres

    while fixed is not True and i < querylim:
        if curerr is False:
            msgs.append(convQuery('That gave the wrong result. Fix.'))
        else:
            msgs.append(convQuery('That gave me '+curerr+'. Fix to work for SQLOracle'))

        completion = client.chat.completions.create(
          model='ft:gpt-3.5-turbo-0125:personal::96kERypj',
          messages=msgs
        )

        newsql=completion.choices[0].message.content
        nmsg = convCompletion(completion)
        msgs.append(nmsg)

        curerr = compSQL(newsql,sql2,debug=False,uq=userquery)
        if curerr is True:
            fixed = True


            if debug:
                print('Succesfully Fixed!')
                print(newsql)
                printConv(msgs[1:])
                print('\n')

            return newsql

        i += 1

    if debug:
        print('Failed to Fix')
        printConv(msgs[1:])
        print('\n')

    return False
                 
def compSQL(predicted,sql2,debug=False,uq=None):
    with engine.connect() as connection:
        real = connection.execute(text(sql2))
        res2 = real.fetchall()
        cols2 = real.keys()
        real.close()

        try:
            predicted = connection.execute(text(predicted))
            res1 = predicted.fetchall()
            cols1 = predicted.keys()
            predicted.close()
        except Exception as e:
            # if debug:
            #     if uq is not None:
            #         print(uq)
                # print(e,'\n')
                
                # print(predicted)
                # print(fixedquery,'\n')
            fixedquerystr = 'Your attempt to code user query '+uq + ' in oracleSQL gave me error ' +str(e)+'. Fix'
            fixedquery = sendUserQuery(fixedquerystr)

            return 'Error '+fixedquery


        
        return cols1 == cols2 and res1 == res2
        


# print(tabulate([ [r[1],r[-1]] for r in restable],headers='firstrow',tablefmt='fancy_grid'))

#### Run Tests

In [7]:
# connection = engine.connect()
file = open('userqueries.txt','r')
restable=[['Index','User Query', 'Our SQL','Generated SQL','Correct?']]
userqueries = [l for l in file]

realqueries = extract_queries_from_file('postgresqueries.sql',includesemi=True)

errors = 0
wrong = 0
fixed = 0 
correct = 0 
attemptedfixes = {True:0,False:0,'Error':0}
for i in range(len(userqueries)):
    r = sendUserQuery(userqueries[i])   
    # r = r.replace('"',"'")
    # r = r.replace('\n',' ')

    # print('Debug Messages:',i)
    # print(f'\t{userqueries[i]}\n')
    # print(f'\t{r}\n')
    # print(f'\t{realqueries[i]}\n')
    
    comp = compSQL(r,realqueries[i],debug=True,uq = userqueries[i])

    if comp is True:
        correct += 1
    elif comp is False:
        # wrong += 1
        res = debugResult(userqueries[i],realqueries[i],r,comp,querylim=10)
        if res == False:
            wrong += 1
        elif res == True:
            r = res
            comp = 'Fixed'
            fixed += 1
        else:
            errors += 1

    else:
        # errors += 1
        res = debugResult(userqueries[i],realqueries[i],r,comp,querylim=10)
        if res == True:
            r = res
            comp = 'Fixed'
            fixed += 1
        elif res == False:
            wrong += 1
        else:
            errors += 1

    restable.append([i,userqueries[i],realqueries[i],r,comp])

print(f'Correct:{correct}, Wrong:{wrong},Errors: {errors}, Fixed:{fixed}')
# df = pd.DataFrame(restable[1:],columns=restable[0])
connection.close()

Correct:8, Wrong:11,Errors: 1, Fixed:0

In [8]:
temp = [ [r[0],r[4] if type(r[4]) is bool else 'Error'] for r in restable]
print(tabulate(temp, headers='firstrow',tablefmt='fancy_grid'))

╒═════════╤═════════╕
│   Index │ Error   │
╞═════════╪═════════╡
│       0 │ True    │
├─────────┼─────────┤
│       1 │ True    │
├─────────┼─────────┤
│       2 │ True    │
├─────────┼─────────┤
│       3 │ False   │
├─────────┼─────────┤
│       4 │ False   │
├─────────┼─────────┤
│       5 │ True    │
├─────────┼─────────┤
│       6 │ True    │
├─────────┼─────────┤
│       7 │ False   │
├─────────┼─────────┤
│       8 │ True    │
├─────────┼─────────┤
│       9 │ True    │
├─────────┼─────────┤
│      10 │ False   │
├─────────┼─────────┤
│      11 │ False   │
├─────────┼─────────┤
│      12 │ True    │
├─────────┼─────────┤
│      13 │ False   │
├─────────┼─────────┤
│      14 │ Error   │
├─────────┼─────────┤
│      15 │ Error   │
├─────────┼─────────┤
│      16 │ False   │
├─────────┼─────────┤
│      17 │ Error   │
├─────────┼─────────┤
│      18 │ Error   │
├─────────┼─────────┤
│      19 │ False   │
╘═════════╧═════════╛

In [42]:
print('Test Results'.center(150))

print(tabulate([ [r[1],r[4] if (r[4] == True or r[4] == False  or r[4] == 'Correct?' or r[4] == 'Fixed') else 'SQL Failed'] for r in restable],headers='firstrow',tablefmt='fancy_grid'))

csv_file = "output.csv"

# Write the list of lists to a CSV file
with open(csv_file, mode="w", newline="") as file:
    writer = csv.writer(file)
    writer.writerows([ [r[1],r[4] if (r[4] == True or r[4] == False  or r[4] == 'Correct?' or r[4] == 'Fixed') else 'SQL Failed'] for r in restable])

                                                                     Test Results
╒═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╤════════════╕
│ User Query                                                                                                                              │ Correct?   │
╞═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╪════════════╡
│ Give me the addresses of all registered stores.                                                                                         │ True       │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Give me the names along with locations of registered producers.                                                                         │ True       │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Show the names of products which are groceries.                                                                                         │ True       │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Show the number of customers belonging to store 1.                                                                                      │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Show the number of completed transactions.                                                                                              │ False      │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Display the employee’s name with the highest salary.                                                                                    │ Fixed      │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Display the ids and names of products with quantity less than 50.                                                                       │ True       │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Display the number of categories in stock.                                                                                              │ False      │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Provide the address of customers who lives near Elm.                                                                                    │ Fixed      │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Provide the opening and closing time of store 1.                                                                                        │ True       │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Show the name of the manufacturer who produced the product which is now in the biggest discount.                                        │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Show the total price of products purchased by each customer.                                                                            │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Show the names of products that have been discounted by more than 10%.                                                                  │ Fixed      │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Count the total price of products in stock which were produced by Farm Fresh.                                                           │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Provide the address and employee id of the store which has the longest opening time on Monday.                                          │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Provide the information about the products which are produced by Tech Innovate with the price below 600.                                │ Fixed      │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Give me the avg salary of employees who work in the store with the most transactions in Mar,2024.                                       │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Give me the contacts of customers who bought stuff more than 3 days ago but still on pending.                                           │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Display the total sales revenue generated by each store in the last quarter.                                                            │ SQL Failed │
├─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┼────────────┤
│ Display the names and addresses of customers who made purchases in the last month but have not made any purchases in the current month. │ SQL Failed │
╘═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╧════════════╛

#### Spider Dataset Chek

In [49]:
# dirs = os.listdir('finetuningstuff/spider/database')
# print(dirs)

# table = 'academic'

# prim = 'You Convert user queries to sqlite sql statements. Use the following Schema:\n'
# with open('finetuningstuff/spider/database/academic/schema.sql') as f:
#     text = f.read()

# prim += text 

# print(prim)

output = {}
with open('finetuningstuff/spider/train_gold.sql') as f:
    text = f.read()
    lines = text.split('\n')
    
    for line in lines:
        temp = line.split('\t')
        table = temp[-1]
        query = ''.join(temp[:-1])
        print(temp)
        # print(query)
        print(query,table)
        print('\n')

        if table not in output:
            output[table] = []
        output[table].append(query)

['SELECT count(*) FROM head WHERE age  >  56', 'department_management']
SELECT count(*) FROM head WHERE age  >  56 department_management


['SELECT name ,  born_state ,  age FROM head ORDER BY age', 'department_management']
SELECT name ,  born_state ,  age FROM head ORDER BY age department_management


['SELECT creation ,  name ,  budget_in_billions FROM department', 'department_management']
SELECT creation ,  name ,  budget_in_billions FROM department department_management


['SELECT max(budget_in_billions) ,  min(budget_in_billions) FROM department', 'department_management']
SELECT max(budget_in_billions) ,  min(budget_in_billions) FROM department department_management


['SELECT avg(num_employees) FROM department WHERE ranking BETWEEN 10 AND 15', 'department_management']
SELECT avg(num_employees) FROM department WHERE ranking BETWEEN 10 AND 15 department_management


["SELECT name FROM head WHERE born_state != 'California'", 'department_management']
SELECT name FROM head WHERE born_state != 'California' department_management


["SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama'", 'department_management']
SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama' department_management


['SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3', 'department_management']
SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3 department_management


['SELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1', 'department_management']
SELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1 department_management


["SELECT T1.name ,  T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id WHERE T2.temporary_acting  =  'Yes'", 'department_management']
SELECT T1.name ,  T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id WHERE T2.temporary_acting  =  'Yes' department_management


['SELECT count(DISTINCT temporary_acting) FROM management', 'department_management']
SELECT count(DISTINCT temporary_acting) FROM management department_management


['SELECT count(*) FROM department WHERE department_id NOT IN (SELECT department_id FROM management);', 'department_management']
SELECT count(*) FROM department WHERE department_id NOT IN (SELECT department_id FROM management); department_management


["SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'", 'department_management']
SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes' department_management


["SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Homeland Security'", 'department_management']
SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Homeland Security' department_management


['SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1', 'department_management']
SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1 department_management


["SELECT head_id ,  name FROM head WHERE name LIKE '%Ha%'", 'department_management']
SELECT head_id ,  name FROM head WHERE name LIKE '%Ha%' department_management


['SELECT count(*) FROM farm', 'farm']
SELECT count(*) FROM farm farm


['SELECT count(*) FROM farm', 'farm']
SELECT count(*) FROM farm farm


['SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC', 'farm']
SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC farm


['SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC', 'farm']
SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC farm


["SELECT Hosts FROM farm_competition WHERE Theme != 'Aliens'", 'farm']
SELECT Hosts FROM farm_competition WHERE Theme != 'Aliens' farm


["SELECT Hosts FROM farm_competition WHERE Theme != 'Aliens'", 'farm']
SELECT Hosts FROM farm_competition WHERE Theme != 'Aliens' farm


['SELECT Theme FROM farm_competition ORDER BY YEAR ASC', 'farm']
SELECT Theme FROM farm_competition ORDER BY YEAR ASC farm


['SELECT Theme FROM farm_competition ORDER BY YEAR ASC', 'farm']
SELECT Theme FROM farm_competition ORDER BY YEAR ASC farm


['SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000', 'farm']
SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000 farm


['SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000', 'farm']
SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000 farm


['SELECT max(Cows) ,  min(Cows) FROM farm', 'farm']
SELECT max(Cows) ,  min(Cows) FROM farm farm


['SELECT max(Cows) ,  min(Cows) FROM farm', 'farm']
SELECT max(Cows) ,  min(Cows) FROM farm farm


['SELECT count(DISTINCT Status) FROM city', 'farm']
SELECT count(DISTINCT Status) FROM city farm


['SELECT count(DISTINCT Status) FROM city', 'farm']
SELECT count(DISTINCT Status) FROM city farm


['SELECT Official_Name FROM city ORDER BY Population DESC', 'farm']
SELECT Official_Name FROM city ORDER BY Population DESC farm


['SELECT Official_Name FROM city ORDER BY Population DESC', 'farm']
SELECT Official_Name FROM city ORDER BY Population DESC farm


['SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1', 'farm']
SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1 farm


['SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1', 'farm']
SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1 farm


['SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID', 'farm']
SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID farm


['SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID', 'farm']
SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID farm


['SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1', 'farm']
SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1 farm


['SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1', 'farm']
SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1 farm


['SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1', 'farm']
SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1 farm


['SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1', 'farm']
SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1 farm


['SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000', 'farm']
SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000 farm


['SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000', 'farm']
SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000 farm


['SELECT Status ,  avg(Population) FROM city GROUP BY Status', 'farm']
SELECT Status ,  avg(Population) FROM city GROUP BY Status farm


['SELECT Status ,  avg(Population) FROM city GROUP BY Status', 'farm']
SELECT Status ,  avg(Population) FROM city GROUP BY Status farm


['SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC', 'farm']
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC farm


['SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC', 'farm']
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC farm


['SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1', 'farm']
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1 farm


['SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1', 'farm']
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1 farm


['SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)', 'farm']
SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition) farm


['SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)', 'farm']
SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition) farm


['SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500', 'farm']
SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500 farm


['SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500', 'farm']
SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500 farm


['SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500', 'farm']
SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500 farm


['SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500', 'farm']
SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500 farm


['SELECT Census_Ranking FROM city WHERE Status != "Village"', 'farm']
SELECT Census_Ranking FROM city WHERE Status != "Village" farm


['SELECT Census_Ranking FROM city WHERE Status != "Village"', 'farm']
SELECT Census_Ranking FROM city WHERE Status != "Village" farm


['SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1', 'student_assessment']
SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1 student_assessment


['SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1', 'student_assessment']
SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1 student_assessment


['SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1', 'student_assessment']
SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1 student_assessment


['SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1', 'student_assessment']
SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1 student_assessment


['SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id', 'student_assessment']
SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id student_assessment


['SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id', 'student_assessment']
SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id student_assessment


['SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)', 'student_assessment']
SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance) student_assessment


['SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)', 'student_assessment']
SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance) student_assessment


['SELECT student_id FROM student_course_attendance', 'student_assessment']
SELECT student_id FROM student_course_attendance student_assessment


['SELECT student_id FROM student_course_attendance', 'student_assessment']
SELECT student_id FROM student_course_attendance student_assessment


['SELECT T1.student_id ,  T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id', 'student_assessment']
SELECT T1.student_id ,  T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id student_assessment


['SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1', 'student_assessment']
SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1 student_assessment


['SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1', 'student_assessment']
SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1 student_assessment


['SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"', 'student_assessment']
SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English" student_assessment


['SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"', 'student_assessment']
SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English" student_assessment


['SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171', 'student_assessment']
SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171 student_assessment


['SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171', 'student_assessment']
SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171 student_assessment


['SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"', 'student_assessment']
SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org" student_assessment


['SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"', 'student_assessment']
SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org" student_assessment


['SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1', 'student_assessment']
SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1 student_assessment


['SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1', 'student_assessment']
SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1 student_assessment


['SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1', 'student_assessment']
SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1 student_assessment


['SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1', 'student_assessment']
SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1 student_assessment


['SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id', 'student_assessment']
SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id student_assessment


['SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id', 'student_assessment']
SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id student_assessment


['SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id', 'student_assessment']
SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id student_assessment


['SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id', 'student_assessment']
SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id student_assessment


['SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"', 'student_assessment']
SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass" student_assessment


['SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"', 'student_assessment']

In [50]:
print(output)

{'department_management': ['SELECT count(*) FROM head WHERE age  >  56', 'SELECT name ,  born_state ,  age FROM head ORDER BY age', 'SELECT creation ,  name ,  budget_in_billions FROM department', 'SELECT max(budget_in_billions) ,  min(budget_in_billions) FROM department', 'SELECT avg(num_employees) FROM department WHERE ranking BETWEEN 10 AND 15', "SELECT name FROM head WHERE born_state != 'California'", "SELECT DISTINCT T1.creation FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T3.born_state  =  'Alabama'", 'SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3', 'SELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1', "SELECT T1.name ,  T1.num_employees FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id WHERE T2.temporary_acting  =  'Yes'", 'SELECT count(DISTINCT temporary_acting) FROM management', 'SELECT count(*) FROM department WHERE department_id NOT IN (SELECT department_id FROM management);', "SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'", "SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Homeland Security'", 'SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1', "SELECT head_id ,  name FROM head WHERE name LIKE '%Ha%'"], 'farm': ['SELECT count(*) FROM farm', 'SELECT count(*) FROM farm', 'SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC', 'SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC', "SELECT Hosts FROM farm_competition WHERE Theme != 'Aliens'", "SELECT Hosts FROM farm_competition WHERE Theme != 'Aliens'", 'SELECT Theme FROM farm_competition ORDER BY YEAR ASC', 'SELECT Theme FROM farm_competition ORDER BY YEAR ASC', 'SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000', 'SELECT avg(Working_Horses) FROM farm WHERE Total_Horses  >  5000', 'SELECT max(Cows) ,  min(Cows) FROM farm', 'SELECT max(Cows) ,  min(Cows) FROM farm', 'SELECT count(DISTINCT Status) FROM city', 'SELECT count(DISTINCT Status) FROM city', 'SELECT Official_Name FROM city ORDER BY Population DESC', 'SELECT Official_Name FROM city ORDER BY Population DESC', 'SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1', 'SELECT Official_Name ,  Status FROM city ORDER BY Population DESC LIMIT 1', 'SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID', 'SELECT T2.Year ,  T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID', 'SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1', 'SELECT T1.Official_Name FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID HAVING COUNT(*)  >  1', 'SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT T1.Status FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID GROUP BY T2.Host_city_ID ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000', 'SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000', 'SELECT Status ,  avg(Population) FROM city GROUP BY Status', 'SELECT Status ,  avg(Population) FROM city GROUP BY Status', 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC', 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC', 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)', 'SELECT Official_Name FROM city WHERE City_ID NOT IN (SELECT Host_city_ID FROM farm_competition)', 'SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500', 'SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500', 'SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500', 'SELECT Official_Name FROM city WHERE Population  >  1500 OR Population  <  500', 'SELECT Census_Ranking FROM city WHERE Status != "Village"', 'SELECT Census_Ranking FROM city WHERE Status != "Village"'], 'student_assessment': ['SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1', 'SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1', 'SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1', 'SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1', 'SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id', 'SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id', 'SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)', 'SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)', 'SELECT student_id FROM student_course_attendance', 'SELECT student_id FROM student_course_attendance', 'SELECT T1.student_id ,  T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id', 'SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1', 'SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1', 'SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"', 'SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"', 'SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171', 'SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T2.student_id = 171', 'SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"', 'SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"', 'SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1', 'SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1', 'SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1', 'SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1', 'SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id', 'SELECT T1.student_id ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id', 'SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id', 'SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id', 'SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"', 'SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"', 'SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"', 'SELECT T3.cell_mobile_number FROM candidates AS T1 JOIN candidate_assessments AS T2 ON T1.candidate_id = T2.candidate_id JOIN people AS T3 ON T1.candidate_id = T3.person_id WHERE T2.asessment_outcome_code = "Fail"', 'SELECT student_id FROM student_course_attendance WHERE course_id  =  301', 'SELECT student_id FROM student_course_attendance WHERE course_id  =  301', 'SELECT student_id FROM student_course_attendance WHERE course_id = 301 ORDER BY date_of_attendance DESC LIMIT 1', 'SELECT student_id FROM student_course_attendance WHERE course_id = 301 ORDER BY date_of_attendance DESC LIMIT 1', 'SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id', 'SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id', 'SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id JOIN students AS T3 ON T2.person_id = T3.student_id', 'SELECT DISTINCT T1.city FROM addresses AS T1 JOIN people_addresses AS T2 ON T1.address_id = T2.address_id JOIN students AS T3 ON T2.person_id = T3.student_id', 'SELECT course_name FROM courses ORDER BY course_name', 'SELECT course_name FROM courses ORDER BY course_name', 'SELECT first_name FROM people ORDER BY first_name', 'SELECT first_name FROM people ORDER BY first_name', 'SELECT student_id FROM student_course_registrations UNION SELECT student_id FROM student_course_attendance', 'SELECT student_id FROM student_course_registrations UNION SELECT student_id FROM student_course_attendance', 'SELECT course_id FROM student_course_registrations WHERE student_id = 121 UNION SELECT course_id FROM student_course_attendance WHERE student_id = 121', 'SELECT course_id FROM student_course_registrations WHERE student_id = 121 UNION SELECT course_id FROM student_course_attendance WHERE student_id = 121', 'SELECT * FROM student_course_registrations WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)', 'SELECT * FROM student_course_registrations WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)', 'SELECT T2.student_id FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.registration_date', 'SELECT T2.student_id FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.registration_date', 'SELECT T2.student_id FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.date_of_attendance', 'SELECT T2.student_id FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "statistics" ORDER BY T2.date_of_attendance'], 'bike_1': ['SELECT date FROM weather WHERE max_temperature_f  >  85', 'SELECT date FROM weather WHERE max_temperature_f  >  85', 'SELECT name FROM station WHERE lat  <  37.5', 'SELECT name FROM station WHERE lat  <  37.5', 'SELECT city ,  max(lat) FROM station GROUP BY city', 'SELECT city ,  max(lat) FROM station GROUP BY city', 'SELECT start_station_name ,  end_station_name FROM trip ORDER BY id LIMIT 3', 'SELECT start_station_name ,  end_station_name FROM trip ORDER BY id LIMIT 3', 'SELECT avg(lat) ,  avg(long) FROM station WHERE city  =  "San Jose"', 'SELECT avg(lat) ,  avg(long) FROM station WHERE city  =  "San Jose"', 'SELECT id FROM trip ORDER BY duration LIMIT 1', 'SELECT id FROM trip ORDER BY duration LIMIT 1', 'SELECT sum(duration) ,  max(duration) FROM trip WHERE bike_id  =  636', 'SELECT sum(duration) ,  max(duration) FROM trip WHERE bike_id  =  636', 'SELECT zip_code  ,  avg(mean_temperature_f) FROM weather WHERE date LIKE "8/%" GROUP BY zip_code', 'SELECT zip_code  ,  avg(mean_temperature_f) FROM weather WHERE date LIKE "8/%" GROUP BY zip_code', 'SELECT count(DISTINCT bike_id) FROM trip', 'SELECT count(DISTINCT bike_id) FROM trip', 'SELECT count(DISTINCT city) FROM station', 'SELECT count(DISTINCT city) FROM station', 'SELECT COUNT(*) FROM station WHERE city  =  "Mountain View"', 'SELECT COUNT(*) FROM station WHERE city  =  "Mountain View"', 'SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7', 'SELECT DISTINCT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id WHERE T2.bikes_available  =  7', 'SELECT start_station_name ,  start_station_id FROM trip WHERE start_date LIKE "8/%" GROUP BY start_station_name ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT start_station_name ,  start_station_id FROM trip WHERE start_date LIKE "8/%" GROUP BY start_station_name ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT bike_id FROM trip WHERE zip_code  =  94002 GROUP BY bike_id ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT bike_id FROM trip WHERE zip_code  =  94002 GROUP BY bike_id ORDER BY COUNT(*) DESC LIMIT 1', 'SELECT COUNT(*) FROM weather WHERE mean_humidity  >  50 AND mean_visibility_miles  >  8', 'SELECT COUNT(*) FROM weather WHERE mean_humidity  >  50 AND mean_visibility_miles  >  8', 'SELECT T1.lat ,  T1.long ,  T1.city FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id ORDER BY T2.duration LIMIT 1', 'SELECT T1.lat ,  T1.long ,  T1.city FROM station AS T1 JOIN trip AS T2 ON T1.id  =  T2.start_station_id ORDER BY T2.duration LIMIT 1', 'SELECT id FROM station WHERE city  =  "San Francisco" INTERSECT SELECT station_id FROM status GROUP BY station_id HAVING avg(bikes_available)  >  10', 'SELECT id FROM station WHERE city  =  "San Francisco" INTERSECT SELECT station_id FROM status GROUP BY station_id HAVING avg(bikes_available)  >  10', 'SELECT T1.name ,  T1.id FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(T2.bikes_available)  >  14 UNION SELECT name ,  id FROM station WHERE installation_date LIKE "12/%"', 'SELECT T1.name ,  T1.id FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(T2.bikes_available)  >  14 UNION SELECT name ,  id FROM station WHERE installation_date LIKE "12/%"', 'SELECT cloud_cover FROM weather WHERE zip_code  =  94107 GROUP BY cloud_cover ORDER BY COUNT (*) DESC LIMIT 3', 'SELECT cloud_cover FROM weather WHERE zip_code  =  94107 GROUP BY cloud_cover ORDER BY COUNT (*) DESC LIMIT 3', 'SELECT zip_code FROM weather GROUP BY zip_code ORDER BY avg(mean_sea_level_pressure_inches) LIMIT 1', 'SELECT zip_code FROM weather GROUP BY zip_code ORDER BY avg(mean_sea_level_pressure_inches) LIMIT 1', 'SELECT avg(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  "Palo Alto")', 'SELECT avg(bikes_available) FROM status WHERE station_id NOT IN (SELECT id FROM station WHERE city  =  "Palo Alto")', 'SELECT avg(long) FROM station WHERE id NOT IN (SELECT station_id FROM status GROUP BY station_id HAVING max(bikes_available)  >  10)', 'SELECT avg(long) FROM station WHERE id NOT IN (SELECT station_id FROM status GROUP BY station_id HAVING max(bikes_available)  >  10)', 'SELECT date ,  zip_code FROM weather WHERE max_temperature_f  >=  80', 'SELECT date ,  zip_code FROM weather WHERE max_temperature_f  >=  80', 'SELECT T1.id FROM trip AS T1 JOIN weather AS T2 ON T1.zip_code  =  T2.zip_code GROUP BY T2.zip_code HAVING avg(T2.mean_temperature_f)  >  60', 'SELECT T1.id FROM trip AS T1 JOIN weather AS T2 ON T1.zip_code  =  T2.zip_code GROUP BY T2.zip_code HAVING avg(T2.mean_temperature_f)  >  60', 'SELECT zip_code , count(*) FROM weather WHERE max_wind_Speed_mph  >=  25 GROUP BY zip_code', 'SELECT zip_code , count(*) FROM weather WHERE max_wind_Speed_mph  >=  25 GROUP BY zip_code', 'SELECT date ,  zip_code FROM weather WHERE min_dew_point_f  <  (SELECT min(min_dew_point_f) FROM weather WHERE zip_code  =  94107)', 'SELECT date ,  zip_code FROM weather WHERE min_dew_point_f  <  (SELECT min(min_dew_point_f) FROM weather WHERE zip_code  =  94107)', 'SELECT T1.id ,  T2.installation_date FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id', 'SELECT T1.id ,  T2.installation_date FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id', 'SELECT T1.id FROM trip AS T1 JOIN station AS T2 ON T1.start_station_id  =  T2.id ORDER BY T2.dock_count DESC LIMIT 1', 'SELECT T1.id FROM trip AS T1 JOIN station AS T2 ON T1.start_station_id  =  T2.id ORDER BY T2.dock_count DESC LIMIT 1', 'SELECT count(*) FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id WHERE T2.city != "San Francisco"', 'SELECT count(*) FROM trip AS T1 JOIN station AS T2 ON T1.end_station_id  =  T2.id WHERE T2.city != "San Francisco"', 'SELECT date FROM weather WHERE zip_code  =  94107 AND EVENTS != "Fog" AND EVENTS != "Rain"', 'SELECT date FROM weather WHERE zip_code  =  94107 AND EVENTS != "Fog" AND EVENTS != "Rain"', 'SELECT id FROM station WHERE lat  >  37.4 EXCEPT SELECT station_id FROM status GROUP BY station_id HAVING min(bikes_available)  <  7', 'SELECT id FROM station WHERE lat  >  37.4 EXCEPT SELECT station_id FROM status GROUP BY station_id HAVING min(bikes_available)  <  7', 'SELECT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(bikes_available)  >  10 EXCEPT SELECT name FROM station WHERE city  =  "San Jose"', 'SELECT T1.name FROM station AS T1 JOIN status AS T2 ON T1.id  =  T2.station_id GROUP BY T2.station_id HAVING avg(bikes_available)  >  10 EXCEPT SELECT name FROM station WHERE city  =  "San Jose"', 'SELECT name ,  lat ,  city FROM station ORDER BY lat LIMIT 1', 'SELECT name ,  lat ,  city FROM station ORDER BY lat LIMIT 1', 'SELECT date ,  mean_temperature_f ,  mean_humidity FROM weather ORDER BY max_gust_speed_mph DESC LIMIT 3', 'SELECT date ,  mean_temperature_f ,  mean_humidity FROM weather ORDER BY max_gust_speed_mph DESC LIMIT 3', 'SELECT city ,  COUNT(*) FROM station GROUP BY city HAVING COUNT(*)  >=  15', 'SELECT city ,  COUNT(*) FROM station GROUP BY city HAVING COUNT(*)  >=  15', 'SELECT start_station_id ,  start_station_name FROM trip GROUP BY start_station_name HAVING COUNT(*)  >=  200', 'SELECT start_station_id ,  start_station_name FROM trip GROUP BY start_station_name HAVING COUNT(*)  >=  200', 'SELECT zip_code FROM weather GROUP BY zip_code HAVING avg(mean_visibility_miles)  <  10', 'SELECT zip_code FROM weather GROUP BY zip_code HAVING avg(mean_visibility_miles)  <  10', 'SELECT city FROM station GROUP BY city ORDER BY max(lat) DESC', 'SELECT city FROM station GROUP BY city ORDER BY max(lat) DESC', 'SELECT date ,  cloud_cover FROM weather ORDER BY cloud_cover DESC LIMIT 5', 'SELECT date ,  cloud_cover FROM weather ORDER BY cloud_cover DESC LIMIT 5', 'SELECT id ,  duration FROM trip ORDER BY duration DESC LIMIT 3', 'SELECT id ,  duration FROM trip ORDER BY duration DESC LIMIT 3', 'SELECT T1.name ,  T1.long ,  avg(T2.